STMicroelectronics/STM32CubeH7/Projects/STM32H745I-DISCO/Demonstrations/CM7/Src/main_oscillo_cm7.c
};


ButtonWidgetTypeDef GenericButtonsTab[SG_TOTAL_GENERIC_BUTTON_NBR] = 
/************* Return Button  ***********/
{
  { 
    {
      46,  /* Width */
      44, /* Height */
      430,  /* Xpos */ 
      0,  /* Ypos */
      DMA2D_INPUT_ARGB8888,   /* ColorMode */
      SG_WaveButtonCallback /* ButtonCallback*/
    },
    (uint32_t*)(SG_button), /* Return button */
    RETURN,
  }  
};

ButtonWidgetTypeDef UpDownFrequencyButtonsTab[SG_TOTAL_UPDOWN_BUTTON_NBR] = 
{
  {
    /************* Down Button  ***********/
    {
        SG_UPDOWN_BUTTON_WIDTH,  /* Width */
        SG_UPDOWN_BUTTON_HEIGHT, /* Height */
        SG_DOWN_FEQUECNY_BUTTON_XPOSITION,  /* Xpos */ 
        SG_DOWN_FEQUECNY_BUTTON_YPOSITION,  /* Ypos */
        DMA2D_INPUT_ARGB8888,   /* ColorMode */
        NULL  /* ButtonCallback */
    },
    (uint32_t*)(Button_Down), /* FrameBuffer */
    SG_DOWN_BUTTON_INDEX,
  },
  {
    /************* Up Button  ***********/
    {
        SG_UPDOWN_BUTTON_WIDTH,  /* Width */
        SG_UPDOWN_BUTTON_HEIGHT, /* Height */
        SG_UP_FEQUECNY_BUTTON_XPOSITION,  /* Xpos */ 
        SG_UP_FEQUECNY_BUTTON_YPOSITION,  /* Ypos */
        DMA2D_INPUT_ARGB8888,   /* ColorMode */
        NULL  /* ButtonCallback */
    },
    (uint32_t*)(Button_Up), /* FrameBuffer */
    SG_UP_BUTTON_INDEX,
  }  
};

ButtonWidgetTypeDef UpDownAmplitudeButtonsTab[SG_TOTAL_UPDOWN_BUTTON_NBR] = 
{
  {
    /************* Down Button  ***********/
    {
        SG_UPDOWN_BUTTON_WIDTH,  /* Width */
        SG_UPDOWN_BUTTON_HEIGHT, /* Height */
        SG_DOWN_AMPLITUDE_BUTTON_XPOSITION,  /* Xpos */ 
        SG_DOWN_AMPLITUDE_BUTTON_YPOSITION,  /* Ypos */
        DMA2D_INPUT_ARGB8888,   /* ColorMode */
        NULL  /* ButtonCallback */
    },
    (uint32_t*)(Button_Down), /* FrameBuffer */
    SG_DOWN_BUTTON_INDEX,
  },
  {
    /************* Up Button  ***********/
    {
        SG_UPDOWN_BUTTON_WIDTH,  /* Width */
        SG_UPDOWN_BUTTON_HEIGHT, /* Height */
        SG_UP_AMPLITUDE_BUTTON_XPOSITION,  /* Xpos */ 
        SG_UP_AMPLITUDE_BUTTON_YPOSITION,  /* Ypos */
        DMA2D_INPUT_ARGB8888,   /* ColorMode */
        NULL  /* ButtonCallback */
    },
    (uint32_t*)Button_Up, /* FrameBuffer */
    SG_UP_BUTTON_INDEX,
  }  
};


static SG_WaveButtonIndex_e activeButtonIndex = SG_MAX_WAVE_BUTTON_INDEX;
static uint32_t waveFrequency = DAC_MIN_FREQUENCY;
static uint32_t waveAmplitude = DAC_MAX_AMPLITUDE;
static uint8_t  frequencyName[16];
static uint8_t  amplitudeName[10];
extern  const char * cm4_code;
extern uint32_t AutoMode ;
static uint32_t count = 0;


/* Private functions ---------------------------------------------------------*/

/**
  * @brief  Main program.
  * @param  None
  * @retval None
  */
int main(void)
{  
  
  BSP_QSPI_Init_t qspi_init;

  MPU_Config();
  
  /* Enable the CPU Cache */
  CPU_CACHE_Enable();
  
  /* STM32H7xx HAL library initialization:
       - Configure the Systick to generate an interrupt each 1 msec
       - Set NVIC Group Priority to 4
       - Low Level Initialization
   */
  HAL_Init();

  /*  Configure the system clock to 400 MHz */
  SystemClock_Config();  
  
  /* Initialize LED1 */
  BSP_LED_Init(LED1);
  BSP_LED_On(LED1);


  if(__HAL_PWR_GET_FLAG(PWR_FLAG_SB_D1) == RESET)
  {
     /* When system initialization is finished, Cortex-M7 will release (wakeup) Cortex-M4  by means of 
       HSEM notification. Cortex-M4 release could be also ensured by any Domain D2 wakeup source (SEV,EXTI..).
    */

    /* HW semaphore Clock enable */
    __HAL_RCC_HSEM_CLK_ENABLE();
  
    __HAL_RCC_C1_D2SRAM1_CLK_ENABLE(); 

    /* Copy CM4 code from Flash to D2_SRAM memory */
    memcpy((void *)D2_AXISRAM_BASE,  &cm4_code, 0x20000);

    HAL_SYSCFG_CM4BootAddConfig(SYSCFG_BOOT_ADDR0, D2_AXISRAM_BASE); /*0x1000000*/


   /* Enable CPU2 (Cortex-M4) boot regardless of option byte values */
    HAL_RCCEx_EnableBootCore(RCC_BOOT_C2);
    
    /* Configure the boot address to be used after reset */
    HAL_Delay(100);
    HAL_SYSCFG_CM4BootAddConfig(SYSCFG_BOOT_ADDR0, FLASH_BANK2_BASE); /* 0x08100000*/
  }

  qspi_init.InterfaceMode=MT25TL01G_QPI_MODE;
  qspi_init.TransferRate= MT25TL01G_DTR_TRANSFER ;
  qspi_init.DualFlashMode= MT25TL01G_DUALFLASH_ENABLE;

  BSP_QSPI_Init(0, &qspi_init);
  BSP_QSPI_EnableMemoryMappedMode(0);
  
  SG_InitGeneratorMenu();
  
  /* Infinite loop */
  while (1)
  {   
    SG_StartGeneratorProcess();
    BSP_LED_Toggle(LED1);
  }  
}

/**
  * @brief  Init the main generator menu
  * @param  None
  * @retval None
  */
static void SG_InitGeneratorMenu(void)
{
  uint8_t  frequencyName[10];
  /* Init the Display */  
  SG_InitDisplay();
  
  /* Init the touch screen */
  SG_InitTouchScreen();

  /* Display background image */
  SG_DisplayBackgroundImage(BackgroundImage,1); 
  
  /* Display Demo title */
  UTIL_LCD_SetTextColor(UTIL_LCD_COLOR_GREEN);
  UTIL_LCD_SetBackColor(UTIL_LCD_COLOR_GRAY);
  UTIL_LCD_SetFont(&Font24);
  UTIL_LCD_DisplayStringAt(0, 2,(uint8_t *)"SIGNALS GENERATOR", CENTER_MODE);
  
  UTIL_LCD_SetTextColor(UTIL_LCD_COLOR_BLUE);
  UTIL_LCD_SetBackColor(0xFFCCCFF2);
  UTIL_LCD_SetFont(&Font16);
  UTIL_LCD_DisplayStringAt(0, 210,(uint8_t *)" Press User Button to enter STANDBY mode ", CENTER_MODE);


  UTIL_LCD_SetTextColor(UTIL_LCD_COLOR_WHITE);  
  UTIL_LCD_FillRect(6, 233 , 466, 34, UTIL_LCD_COLOR_WHITE);
  
  UTIL_LCD_SetTextColor(UTIL_LCD_COLOR_DARKMAGENTA);
  UTIL_LCD_SetBackColor(UTIL_LCD_COLOR_WHITE);

  UTIL_LCD_DrawRect(3, 230 , 472, 40, UTIL_LCD_COLOR_WHITE);
  UTIL_LCD_DrawRect(4, 231 , 470, 38, UTIL_LCD_COLOR_WHITE);
  
  UTIL_LCD_SetFont(&Font20);
  UTIL_LCD_DisplayStringAt(20, 234,(uint8_t *) "           STM32H745           ", LEFT_MODE);
  UTIL_LCD_SetFont(&Font16);
  UTIL_LCD_DisplayStringAt(20, 251,(uint8_t *)"    Dual core STM32 Microcontroller    ", LEFT_MODE);


  
  /* Display wave buttons */
  SG_DisplayWaveButtons(WaveButtonsTab, SG_TOTAL_WAVE_BUTTON_NBR);
  SG_DisplayGenericButtons(GenericButtonsTab, (uint32_t)SG_TOTAL_GENERIC_BUTTON_NBR) ;
  /* Display frequency */
  sprintf((char*)frequencyName , "%u.000 KHZ", 0);
  SG_DisplayFrequencyIcon(SG_FREQ_RECT_XPOSITION, SG_FREQ_RECT_YPOSITION, SG_FREQ_RECT_WIDHT, SG_FREQ_RECT_HEIGHT, frequencyName);
  
