STMicroelectronics/STM32CubeH7/Projects/STM32H745I-DISCO/Demonstrations/CM7/Src/main_oscillo_cm7.c
  /* Display frequency up down buttons */
  SG_DisplayUpDownButtons(UpDownFrequencyButtonsTab, SG_TOTAL_UPDOWN_BUTTON_NBR); 
  
  /* Display amplitude */
  sprintf((char*)amplitudeName , "%2.3f V", 3.3);
  SG_DisplayAmplitudeIcon(SG_AMPL_RECT_XPOSITION, SG_AMPL_RECT_YPOSITION, SG_AMPL_RECT_WIDHT, SG_AMPL_RECT_HEIGHT, amplitudeName);
  
  /* Display amplitude up down buttons */
  SG_DisplayUpDownButtons(UpDownAmplitudeButtonsTab, SG_TOTAL_UPDOWN_BUTTON_NBR); 
  
  /* Configure the Wakeup push-button in GPIO Mode */
  BSP_PB_Init(BUTTON_USER, BUTTON_MODE_GPIO);
}


/**
  * @brief  Set the output generated wave frequency
  * @param  None
  * @retval None
  */
static void SG_SetWaveFrequency(void)
{
  SG_UpDownButtonIndex_e UpDownButtonIndex = SG_MAX_UPDOWN_BUTTON_INDEX;
  
  /* Get button up down status */
  UpDownButtonIndex = SG_GetUpDownButtonIndex(UpDownFrequencyButtonsTab, SG_TOTAL_UPDOWN_BUTTON_NBR);
  HAL_Delay(50);
  
  if(UpDownButtonIndex != SG_MAX_UPDOWN_BUTTON_INDEX)
  {       
    if((activeButtonIndex != SG_DC_WAVE_BUTTON_INDEX) && (activeButtonIndex != SG_NOISE_WAVE_BUTTON_INDEX))
    {
      if(UpDownButtonIndex == SG_UP_BUTTON_INDEX)
      {
        if(waveFrequency >= DAC_MAX_FREQUENCY)
        {
          waveFrequency = DAC_MAX_FREQUENCY;
        }
        else
        {
          waveFrequency += DAC_OFFSET_FREQUENCY;
        }
      }
      else
      {
        if(waveFrequency <= DAC_MIN_FREQUENCY)
        {
          waveFrequency = DAC_MIN_FREQUENCY;
        }
        else
        {
          waveFrequency -= DAC_OFFSET_FREQUENCY;
        }
      }
              
      sprintf((char*)frequencyName , "%lu.000 KHZ", (waveFrequency/1000));
    }
    else
    {
      waveFrequency = DAC_MIN_FREQUENCY;
      sprintf((char*)frequencyName , "N.A");
    }
    SG_GenerateWave(activeButtonIndex, waveFrequency, waveAmplitude);
    SG_DisplayFrequencyIcon(SG_FREQ_RECT_XPOSITION, SG_FREQ_RECT_YPOSITION, SG_FREQ_RECT_WIDHT, SG_FREQ_RECT_HEIGHT, frequencyName);
    SG_DisplayUpDownButtons(UpDownFrequencyButtonsTab, SG_TOTAL_UPDOWN_BUTTON_NBR); 
    
    
  }
}

/**
  * @brief  Set the output generated wave Amplitude
  * @param  None
  * @retval None
  */
static void SG_SetWaveAmplitude(void)
{
  SG_UpDownButtonIndex_e UpDownButtonIndex = SG_MAX_UPDOWN_BUTTON_INDEX;
  
  /* Get button up down status */
  UpDownButtonIndex = SG_GetUpDownButtonIndex(UpDownAmplitudeButtonsTab, SG_TOTAL_UPDOWN_BUTTON_NBR);
  HAL_Delay(50);
  
  if(UpDownButtonIndex != SG_MAX_UPDOWN_BUTTON_INDEX)
  {       
    if(UpDownButtonIndex == SG_UP_BUTTON_INDEX)
    {
      if(waveAmplitude >= DAC_MAX_AMPLITUDE)
      {
        waveAmplitude = DAC_MAX_AMPLITUDE;
      }
      else
      {
        waveAmplitude += DAC_OFFSET_AMPLITUDE;
      }
    }
    else
    {
      if(waveAmplitude <= DAC_MIN_AMPLITUDE)
      {
        waveAmplitude = DAC_MIN_AMPLITUDE;
      }
      else
      {
        waveAmplitude -= DAC_OFFSET_AMPLITUDE;
      }
    }
            
    sprintf((char*)amplitudeName , "%2.3f V", (float)waveAmplitude/1000);
    SG_GenerateWave(activeButtonIndex, waveFrequency, waveAmplitude);
    SG_DisplayAmplitudeIcon(SG_AMPL_RECT_XPOSITION, SG_AMPL_RECT_YPOSITION, SG_AMPL_RECT_WIDHT, SG_AMPL_RECT_HEIGHT, amplitudeName);
    SG_DisplayUpDownButtons(UpDownAmplitudeButtonsTab, SG_TOTAL_UPDOWN_BUTTON_NBR); 
  }
}

/**
  * @brief  Set the output generated wave format
  * @param  None
  * @retval None
  */
static void SG_SetWaveFormat(void)
{ 
  SG_WaveButtonIndex_e WaveButtonIndex = SG_MAX_WAVE_BUTTON_INDEX;
  char  status_msg[20]; 
  char  status_type[20];  
  char  status_freq[20];  
  WaveButtonIndex = SG_GetWaveButtonIndex(WaveButtonsTab, SG_TOTAL_WAVE_BUTTON_NBR);
  
  
  HAL_Delay(50);
  
  if(WaveButtonIndex != SG_MAX_WAVE_BUTTON_INDEX)
  {
    
    SG_SwitchWaveButtonState(WaveButtonsTab, WaveButtonIndex, SG_TOTAL_WAVE_BUTTON_NBR);
    if(WaveButtonsTab[WaveButtonIndex].State == BUTTON_STATE_ON)
    {
      activeButtonIndex = WaveButtonIndex;
      
      if((activeButtonIndex != SG_DC_WAVE_BUTTON_INDEX) && (activeButtonIndex != SG_NOISE_WAVE_BUTTON_INDEX))
      {
        sprintf((char*)frequencyName , "%lu.000KHZ", (waveFrequency/1000));
      }
      else
      {
        waveFrequency = DAC_MIN_FREQUENCY;
        sprintf((char*)frequencyName , "    N.A");
      }
      SG_GenerateWave(WaveButtonIndex, waveFrequency, waveAmplitude);
      
      SG_DisplayFrequencyIcon(SG_FREQ_RECT_XPOSITION, SG_FREQ_RECT_YPOSITION, SG_FREQ_RECT_WIDHT, SG_FREQ_RECT_HEIGHT, frequencyName);
      SG_DisplayUpDownButtons(UpDownFrequencyButtonsTab, SG_TOTAL_UPDOWN_BUTTON_NBR);
      SG_DisplayUpDownButtons(UpDownAmplitudeButtonsTab, SG_TOTAL_UPDOWN_BUTTON_NBR);
      
      
    }
    else
    {
      SG_StopWaveGeneration();
      activeButtonIndex = SG_MAX_WAVE_BUTTON_INDEX;
      
    }
  }
  
  if(WaveButtonsTab[activeButtonIndex].State == BUTTON_STATE_ON)
  {
    
    if(activeButtonIndex == SG_DC_WAVE_BUTTON_INDEX)
    {
      LCD_CopyImage((uint32_t*)sig_dc,(uint32_t *)LCD_FRAME_BUFFER, 360,70, 112, 80, DMA2D_INPUT_ARGB8888, 0);
      LCD_CopyImage((uint32_t*)sig_dc,(uint32_t *)LCD_FRAME_BUFFER, 361,70, 112, 80, DMA2D_INPUT_ARGB8888, 0);
      sprintf(status_type , "Type:    DC    ");
      sprintf(status_freq , "Freq: %lu HZ", (waveFrequency));
    }
    if(activeButtonIndex == SG_SQUARE_WAVE_BUTTON_INDEX)
    {
      LCD_CopyImage((uint32_t*)sig_sqr,(uint32_t *)LCD_FRAME_BUFFER, 360,70, 112, 80, DMA2D_INPUT_ARGB8888, 0);
      LCD_CopyImage((uint32_t*)sig_sqr,(uint32_t *)LCD_FRAME_BUFFER, 361,70, 112, 80, DMA2D_INPUT_ARGB8888, 0);
      sprintf(status_type , "Type:   Square ");
      sprintf(status_freq , "Freq: %lu HZ", (waveFrequency));
    }
    if(activeButtonIndex == SG_SINE_WAVE_BUTTON_INDEX)
    {
      LCD_CopyImage((uint32_t*)sig_sine,(uint32_t *)LCD_FRAME_BUFFER, 360,70, 112, 80, DMA2D_INPUT_ARGB8888, 0);
      LCD_CopyImage((uint32_t*)sig_sine,(uint32_t *)LCD_FRAME_BUFFER, 361,70, 112, 80, DMA2D_INPUT_ARGB8888, 0);
      sprintf(status_type , "Type:   Sinus  ");
      sprintf(status_freq , "Freq: %lu HZ", (waveFrequency));
    }
    if(activeButtonIndex == SG_TRIANGLE_WAVE_BUTTON_INDEX)
    {
      LCD_CopyImage((uint32_t*)sig_tri,(uint32_t *)LCD_FRAME_BUFFER, 360,70, 112, 80, DMA2D_INPUT_ARGB8888, 0);
      LCD_CopyImage((uint32_t*)sig_tri,(uint32_t *)LCD_FRAME_BUFFER, 361,70, 112, 80, DMA2D_INPUT_ARGB8888, 0);
      sprintf(status_type , "Type: Triangle ");
      sprintf(status_freq , "Freq: %lu HZ", (waveFrequency));
    }
    if(activeButtonIndex == SG_ESCALATOR_WAVE_BUTTON_INDEX)
    {
      LCD_CopyImage((uint32_t*)sig_esca,(uint32_t *)LCD_FRAME_BUFFER, 360,70, 112, 80, DMA2D_INPUT_ARGB8888, 0);
      LCD_CopyImage((uint32_t*)sig_esca,(uint32_t *)LCD_FRAME_BUFFER, 361,70, 112, 80, DMA2D_INPUT_ARGB8888, 0);
      sprintf(status_type , "Type: Escalator");
      sprintf(status_freq , "Freq: %lu HZ", (waveFrequency));
    }
    if(activeButtonIndex == SG_NOISE_WAVE_BUTTON_INDEX)
    {
      LCD_CopyImage((uint32_t*)sig_noise,(uint32_t *)LCD_FRAME_BUFFER, 360,70, 112, 80, DMA2D_INPUT_ARGB8888, 0);
      LCD_CopyImage((uint32_t*)sig_noise,(uint32_t *)LCD_FRAME_BUFFER, 361,70, 112, 80, DMA2D_INPUT_ARGB8888, 0);
      sprintf(status_type , "Type:   Noise  ");
      sprintf(status_freq , "Freq: ------ HZ");
    }
    
    UTIL_LCD_SetFont(&Font12);
    UTIL_LCD_SetTextColor(UTIL_LCD_COLOR_GREEN);
    UTIL_LCD_SetBackColor(UTIL_LCD_COLOR_BLACK);  
    UTIL_LCD_DisplayStringAt(364, 156, (uint8_t*)status_type, LEFT_MODE);  
    UTIL_LCD_DisplayStringAt(364, 172, (uint8_t*)status_freq, LEFT_MODE);
    sprintf((char*)status_msg ,"Ampl: %lu mV", (waveAmplitude));
    UTIL_LCD_DisplayStringAt(364, 188, (uint8_t*)status_msg, LEFT_MODE);   
    
