STMicroelectronics/STM32CubeH7/Projects/STM32H745I-DISCO/Demonstrations/CM7/Src/main_oscillo_cm7.c
  }
  else
  {
    
    LCD_CopyImage((uint32_t*)sig_none,(uint32_t *)LCD_FRAME_BUFFER, 360,70, 112, 80, DMA2D_INPUT_ARGB8888, 0);
    
    UTIL_LCD_SetFont(&Font12);
    UTIL_LCD_SetTextColor(UTIL_LCD_COLOR_GREEN);
    UTIL_LCD_SetBackColor(UTIL_LCD_COLOR_BLACK);
    UTIL_LCD_DisplayStringAt(364, 156,(uint8_t *) "Type:   N.A    ", LEFT_MODE);
    UTIL_LCD_DisplayStringAt(364, 172,(uint8_t *) "Freq: ------ HZ", LEFT_MODE);
    UTIL_LCD_DisplayStringAt(364, 188,(uint8_t *) "Ampl: ------ mV", LEFT_MODE);
  }
  
  
  
  
  
}


/**
  * @brief  Enter D1 domain to Standby mode when the user press Wakeup button
  * @param  None
  * @retval None
  */
static void SG_EnterGeneratorLowPowerMode(void)
{
  GPIO_InitTypeDef   GPIO_InitStructure;
  
  if(BSP_PB_GetState(BUTTON_USER) != RESET)
  {
    UTIL_LCD_SetTextColor(UTIL_LCD_COLOR_RED);
    UTIL_LCD_SetBackColor(UTIL_LCD_COLOR_LIGHTGRAY);
    UTIL_LCD_SetFont(&Font12);
    UTIL_LCD_DisplayStringAt(0, 212,(uint8_t *) "   The D1 Domain will Enter STANDBY mode after 3 seconds ...   ", CENTER_MODE);
    
    /* -2- Configure EXTI15_10 (connected to PC.13 pin) to interrupt CPU1 and CPU2 */
    /* Enable GPIOC clock */
    __HAL_RCC_GPIOC_CLK_ENABLE();
    
    /* Configure PC.13 pin as the EXTI input event line in interrupt mode for both CPU1 and CPU2*/
    GPIO_InitStructure.Mode = GPIO_MODE_IT_RISING;    /* current CPU (CM7) config in IT rising */
    GPIO_InitStructure.Pull = GPIO_NOPULL;
    GPIO_InitStructure.Pin = GPIO_PIN_13;
    HAL_GPIO_Init(GPIOC, &GPIO_InitStructure);
    
    /* Enable and set EXTI lines 15 to 10 Interrupt to the lowest priority */
    HAL_NVIC_SetPriority(EXTI15_10_IRQn, 2, 0);
    HAL_NVIC_EnableIRQ(EXTI15_10_IRQn);
    
    /* Configure the CPU (CM7) EXTI line for IT*/
    HAL_EXTI_D1_EventInputConfig(EXTI_LINE13 , EXTI_MODE_IT,  ENABLE);
    
    /* Clear system Standby flag */
    __HAL_PWR_CLEAR_FLAG(PWR_FLAG_SB); 
    
    /* Insert 1 seconds delay */
    HAL_Delay(3000);
    
    BSP_LCD_SetBrightness(0, 0);
    HAL_Delay(10);
    BSP_LCD_DisplayOff(0);
    SG_StopWaveGeneration();
    __HAL_RCC_DAC12_CLK_DISABLE();
    BSP_LED_Off(LED1);
    /* Enter D1 domain to DStandby mode */
    HAL_PWREx_EnterSTANDBYMode(PWR_D1_DOMAIN);
  }
}

/**
  * @brief  Start the generator process
  * @param  None
  * @retval None
  */
static void SG_StartGeneratorProcess(void)
{ 
  uint8_t msg[16];
 
  /* Update wave format when user set frequency */ 
  SG_SetWaveFormat();
    
  /* Update wave frequency when user set up down buttons */ 
  SG_SetWaveFrequency();
  
  /* Update wave Amplitude when user set up down buttons */ 
  SG_SetWaveAmplitude();
  
  /* Enter D1 domain to Standby mode when the user press Wakeup button */
  SG_EnterGeneratorLowPowerMode();

  /* Check Return Button */
  SG_UpdateGenericButtons(GenericButtonsTab);

  
  count++;
  
  if (AutoMode==1)
  {      
    if (count %2 ==0)
    {
      UTIL_LCD_SetFont(&Font12);
      UTIL_LCD_SetTextColor(UTIL_LCD_COLOR_RED); 
      sprintf((char*)msg , "!!!AUTO!!!");
      UTIL_LCD_SetBackColor(UTIL_LCD_COLOR_WHITE);
      UTIL_LCD_DisplayStringAt(400,240, msg, LEFT_MODE);
    }
    else
    {
      UTIL_LCD_SetFont(&Font12);
      UTIL_LCD_SetTextColor(UTIL_LCD_COLOR_WHITE); 
      UTIL_LCD_FillRect(400, 240, 70, 15, UTIL_LCD_COLOR_WHITE);  
    }
    
  } 
  else
  {
    UTIL_LCD_SetFont(&Font12);
    UTIL_LCD_SetTextColor(UTIL_LCD_COLOR_WHITE); 
    UTIL_LCD_FillRect(400, 240, 70, 15, UTIL_LCD_COLOR_WHITE);  
  }


  
}

/**
  * @brief  Wave button callback
  * @param  None
  * @retval None
  */
static void  SG_WaveButtonCallback( void *pData)
{
}

/**
  * @brief  System Clock Configuration
  * @param  None
  * @retval None
  */
static void SystemClock_Config(void)
{
  RCC_ClkInitTypeDef RCC_ClkInitStruct;
  HAL_StatusTypeDef ret = HAL_OK;
  RCC_PeriphCLKInitTypeDef PeriphClkInitStruct;
  
#if (USE_VOS0_480MHZ_OVERCLOCK == 1)

#if (BOARD_HW_CONFIG_IS_LDO == 1) && (BOARD_HW_CONFIG_IS_DIRECT_SMPS == 0)
  /*!< Supply configuration update enable */
  HAL_PWREx_ConfigSupply(PWR_LDO_SUPPLY);   
#else
  #error "Please make sure that the STM32H745I-DISCO Board has been modified to match the LDO configuration then set the define BOARD_HW_CONFIG_IS_LDO to 1 and BOARD_HW_CONFIG_IS_DIRECT_SMPS set to 0 to confirm the HW config"
#endif  /* (BOARD_HW_CONFIG_IS_LDO == 1) && (BOARD_HW_CONFIG_IS_DIRECT_SMPS == 0) */

#else

#if (BOARD_HW_CONFIG_IS_LDO == 0) && (BOARD_HW_CONFIG_IS_DIRECT_SMPS == 1)
  /*!< Supply configuration update enable */
  HAL_PWREx_ConfigSupply(PWR_DIRECT_SMPS_SUPPLY);
#else
  #error "Please make sure that the STM32H745I-DISCO Board has been modified to match the Direct SMPS configuration then set the define BOARD_HW_CONFIG_IS_LDO to 0 and BOARD_HW_CONFIG_IS_DIRECT_SMPS set to 1 to confirm the HW config"
#endif  /* (BOARD_HW_CONFIG_IS_LDO == 0) && (BOARD_HW_CONFIG_IS_DIRECT_SMPS == 1) */  

#endif /* USE_VOS0_480MHZ_OVERCLOCK */

  /* The voltage scaling allows optimizing the power consumption when the device is 
     clocked below the maximum system frequency, to update the voltage scaling value 
     regarding system frequency refer to product datasheet.  */
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

  while(!__HAL_PWR_GET_FLAG(PWR_FLAG_VOSRDY)) {}
  
#if (USE_VOS0_480MHZ_OVERCLOCK == 1)
  
  __HAL_RCC_SYSCFG_CLK_ENABLE();
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE0);  
  while(!__HAL_PWR_GET_FLAG(PWR_FLAG_VOSRDY)) {}

  SystemClock_Config_480MHz();
#else
  SystemClock_Config_400MHz();
#endif /* (USE_VOS0_480MHZ_OVERCLOCK == 1) */
  
/* Select PLL as system clock source and configure  bus clocks dividers */
  RCC_ClkInitStruct.ClockType = (RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_D1PCLK1 | RCC_CLOCKTYPE_PCLK1 | \
                                 RCC_CLOCKTYPE_PCLK2  | RCC_CLOCKTYPE_D3PCLK1);

  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.SYSCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_HCLK_DIV2;
  RCC_ClkInitStruct.APB3CLKDivider = RCC_APB3_DIV2;  
  RCC_ClkInitStruct.APB1CLKDivider = RCC_APB1_DIV2; 
  RCC_ClkInitStruct.APB2CLKDivider = RCC_APB2_DIV2; 
  RCC_ClkInitStruct.APB4CLKDivider = RCC_APB4_DIV2; 
  ret = HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_4);
  if(ret != HAL_OK)
  {
    Error_Handler();
  }

#if (USE_VOS0_480MHZ_OVERCLOCK == 1)
  /* By default the FMC source clock is the AXI bus clock
     The maximum FMC allowed frequency is 200MHz
     when switching the system clock to 480MHz , the AXI bus clock is 240MHz:
       - In this case the FMC source clock is switched to PLL2 (DIVR) with 200MHz frequency    
  */

  /* PLL2_VCO Input = HSE_VALUE/PLL2_M = 5 Mhz */
  /* PLL2_VCO Output = PLL2_VCO Input * PLL_N = 800 Mhz */
  /* FMC Kernel Clock = PLL2_VCO Output/PLL_R = 800/4 = 200 Mhz */
  PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_FMC;
  PeriphClkInitStruct.FmcClockSelection = RCC_FMCCLKSOURCE_PLL2;
  PeriphClkInitStruct.PLL2.PLL2RGE = RCC_PLL1VCIRANGE_2;
  PeriphClkInitStruct.PLL2.PLL2M = 5;
  PeriphClkInitStruct.PLL2.PLL2N = 160;
  PeriphClkInitStruct.PLL2.PLL2FRACN = 0;
  PeriphClkInitStruct.PLL2.PLL2P = 2;
  PeriphClkInitStruct.PLL2.PLL2R = 4;
  PeriphClkInitStruct.PLL2.PLL2Q = 4;
  PeriphClkInitStruct.PLL2.PLL2VCOSEL = RCC_PLL2VCOWIDE;
  ret = HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct);
  if(ret != HAL_OK)
  {
    Error_Handler();
  }
#endif

/* Select PLL2 As an independant clock source generator for ADC (PLL2 output = 36 MHz) */
  PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_ADC;
  PeriphClkInitStruct.AdcClockSelection = RCC_ADCCLKSOURCE_PLL2;
  PeriphClkInitStruct.PLL2.PLL2M = 5;
  PeriphClkInitStruct.PLL2.PLL2N = 160;
  PeriphClkInitStruct.PLL2.PLL2P = 22;
  PeriphClkInitStruct.PLL2.PLL2Q = 4;
  PeriphClkInitStruct.PLL2.PLL2R = 4;
  PeriphClkInitStruct.PLL2.PLL2RGE = RCC_PLL2VCIRANGE_2;
  PeriphClkInitStruct.PLL2.PLL2VCOSEL = RCC_PLL2VCOWIDE;
  PeriphClkInitStruct.PLL2.PLL2FRACN = 0;
  if(HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

